app/controllers/songs_controller.rb

  def create
    @song = Song.new(song_params)
    @artist = Artist.find_or_create_by(name: params["song"]["artist_name"])
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Blur"], ["created_at", "2016-01-27 00:20:14.513159"], ["updated_at", "2016-01-27 00:20:14.513159"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Song 2"], ["artist_id", 1], ["created_at", "2016-01-27 00:20:14.516774"], ["updated_at", "2016-01-27 00:20:14.516774"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", "Blur"]]